#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/philward_io/philward_io/runs/run-LssQY2RXJ4PQS8ui

Waiting for the plan to start...

Terraform v1.2.8
on linux_amd64
Initializing plugins and modules...
aws_acm_certificate.acm_certificate: Refreshing state... [id=arn:aws:acm:us-east-1:542829616420:certificate/4f2a114c-9f30-4784-b67b-5aee7a41f19a]
aws_route53_zone.philward_io_zone: Refreshing state... [id=Z003529526RCV8G5J1PS7]
data.aws_caller_identity.current: Reading...
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Reading...
data.aws_route53_zone.philward_io_zone: Reading...
aws_cloudfront_response_headers_policy.security_headers_policy: Refreshing state... [id=dbd58526-3795-4dea-a38a-b0d743f4caaf]
aws_s3_bucket.resume_bucket: Refreshing state... [id=resume.philward.io]
aws_cloudfront_origin_access_identity.resume_oai: Refreshing state... [id=E1AVBUZT0CBMF6]
aws_route53domains_registered_domain.philward_io_domain: Refreshing state... [id=philward.io]
data.aws_caller_identity.current: Read complete after 0s [id=542829616420]
data.aws_cloudfront_cache_policy.resume_distribution_cache_policy: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
data.aws_route53_zone.philward_io_zone: Read complete after 1s [id=Z003529526RCV8G5J1PS7]
aws_route53_record.acm_validation_record["*.philward.io"]: Refreshing state... [id=Z003529526RCV8G5J1PS7__c88ce6dbd651a4d32d84f8a6aa562e90.philward.io._CNAME]
aws_route53_record.acm_validation_record["philward.io"]: Refreshing state... [id=Z003529526RCV8G5J1PS7__c88ce6dbd651a4d32d84f8a6aa562e90.philward.io._CNAME]
aws_s3_bucket_public_access_block.resume_bucket_access_block: Refreshing state... [id=resume.philward.io]
data.aws_iam_policy_document.resume_bucket_policy_document: Reading...
aws_s3_object.resume_bucket_contents["css/styles.css"]: Refreshing state... [id=css/styles.css]
aws_s3_object.resume_bucket_contents["assets/img/profile.png"]: Refreshing state... [id=assets/img/profile.png]
aws_s3_object.resume_bucket_contents["assets/img/favicon.png"]: Refreshing state... [id=assets/img/favicon.png]
aws_s3_object.resume_bucket_contents["index.html"]: Refreshing state... [id=index.html]
data.aws_iam_policy_document.resume_bucket_policy_document: Read complete after 0s [id=3877817331]
aws_s3_object.resume_bucket_contents["js/scripts.js"]: Refreshing state... [id=js/scripts.js]
aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E5CPX462LFNKX]
aws_s3_bucket_policy.resume_bucket_policy: Refreshing state... [id=resume.philward.io]
aws_route53_record.resume_domain: Refreshing state... [id=Z003529526RCV8G5J1PS7_resume.philward.io_A]
aws_route53_record.root_domain: Refreshing state... [id=Z003529526RCV8G5J1PS7_philward.io_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_kms_key.dnssec_kms_key will be created
  + resource "aws_kms_key" "dnssec_kms_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "ECC_NIST_P256"
      + deletion_window_in_days            = 7
      + description                        = (known after apply)
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "SIGN_VERIFY"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:DescribeKey",
                          + "kms:GetPublicKey",
                          + "kms:Sign",
                        ]
                      + Condition = {
                          + ArnLike      = {
                              + "aws:SourceArn" = "arn:aws:route53:::hostedzone/Z003529526RCV8G5J1PS7"
                            }
                          + StringEquals = {
                              + "aws:SourceAccount" = "542829616420"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dnssec-route53.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow Route 53 DNSSEC Service"
                    },
                  + {
                      + Action    = "kms:CreateGrant"
                      + Condition = {
                          + Bool = {
                              + "kms:GrantIsForAWSResource" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dnssec-route53.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow Route 53 DNSSEC Service to CreateGrant"
                    },
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::542829616420:user/terraform-cloud"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags_all                           = (known after apply)
    }

  # aws_route53_key_signing_key.philward_io_ksk will be created
  + resource "aws_route53_key_signing_key" "philward_io_ksk" {
      + digest_algorithm_mnemonic  = (known after apply)
      + digest_algorithm_type      = (known after apply)
      + digest_value               = (known after apply)
      + dnskey_record              = (known after apply)
      + ds_record                  = (known after apply)
      + flag                       = (known after apply)
      + hosted_zone_id             = "Z003529526RCV8G5J1PS7"
      + id                         = (known after apply)
      + key_management_service_arn = (known after apply)
      + key_tag                    = (known after apply)
      + name                       = "philward.io KSK"
      + public_key                 = (known after apply)
      + signing_algorithm_mnemonic = (known after apply)
      + signing_algorithm_type     = (known after apply)
      + status                     = "ACTIVE"
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @phil-ward, Action: `pull_request`*